Repository: DIKO-Doc/DIKO-Doc.github.io
Catalog: cht-to-eng/cht-to-eng-omegat.tmx
Source language: zh_tw
Languages: en

source: The time port must be active before it starts forwarding traffic.
en: 在開始轉發流量之前，時間端口必須處於活動狀態。

source: The time port must be inactive in order to be considered down.
en: 時間端口必須處於非活動狀態才能被視為關閉。

source: The time, in seconds since the Unix Epoch, that the connection was last _successfully_ fully activated. NetworkManager updates the connection timestamp periodically when the connection is active to ensure that an active connection has the latest timestamp. The property is only meant for reading (changes to this property will not be preserved).
en: 自Unix Epoch以來的幾秒鐘內，連接最後_successfully_完全激活的時間。當連接處於活動狀態時，NetworkManager會定期更新連接時間戳，以確保活動連接具有最新時間戳。該屬性僅用於閱讀（不會保留對此屬性的更改）。

source: The translation is ready for use, but %d entry is not translated yet.
en: Transleiçion-wa keyi yusing, bùt %d-gè entri-wa mi-transleiten yet.

source: The translation is ready for use.
en: Transleiçion-wa keyi yusiŋ.

source: The trust level of a the connection. Free form case-insensitive string (for example "Home", "Work", "Public"). NULL or unspecified zone means the connection will be placed in the default zone as defined by the firewall. When updating this property on a currently activated connection, the change takes effect immediately.
en: 連接的信任級別。自由格式不區分大小寫的字符串（例如“Home”，“Work”，“Public”）。 NULL或未指定的區域表示連接將放置在防火牆定義的默認區域中。在當前激活的連接上更新此屬性時，更改會立即生效。

source: The tunneling mode, for example NM_IP_TUNNEL_MODE_IPIP (1) or NM_IP_TUNNEL_MODE_GRE (2).
en: 隧道模式，例如NM_IP_TUNNEL_MODE_IPIP（1）或NM_IP_TUNNEL_MODE_GRE（2）。

source: The type of service (IPv4) or traffic class (IPv6) field to be set on tunneled packets.
en: 要在隧道數據包上設置的服務類型（IPv4）或流量類（IPv6）字段。

source: The upper bound for sharing integer constants
en: 共享整型常數的上界

source: The user ID which will own the device. If set to NULL everyone will be able to use the device.
en: 擁有設備的用戶ID。如果設置為NULL，則每個人都可以使用該設備。

source: The username used to authenticate with the network, if required. Many providers do not require a username, or accept any username. But if a username is required, it is specified here.
en: 用於通過網絡進行身份驗證的用戶名（如果需要）。許多提供商不需要用戶名，也不接受任何用戶名。但如果需要用戶名，則在此處指定。

source: The valid syntax is: 'ip[/prefix] [next-hop] [metric] [attribute=val]... [,ip[/prefix] ...]'
en: 有效語法為：'ip [/ prefix] [next-hop] [metric] [attribute = val] ... [，ip [/ prefix] ...]'

source: The valid syntax is: vf [attribute=value]... [,vf [attribute=value]...]
en: 有效語法為：vf [attribute = value] ... [，vf [attribute = value] ...]

source: There was a problem opening the file “%s”.
en: 開啟檔案「%s」時發生問題。

source: This beta version of Poedit expired.
en: Nigè Poedit dè beta vörçion wa ikspair-zoru.

source: This file can not be written to. You may click here to unlock this file and make changes anyway, but these changes must be saved to a new file.
en: 無法寫入此檔案。您可以點擊此處解鎖此檔案並強制變更，但是這些變更只能儲存到一個新檔案中。

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
en: 本程式是自由軟體；請參看來源程式碼的版權宣告。本軟體沒有任何擔保； 包括沒有適銷性和某一專用目的下的適用性擔保。

source: This is the height of the main version control tree when the console pane is shown.
en: 這是當顯示主控台窗格時，主版本控制樹的高度。

source: This remote location does not support sending items to the trash.
en: 這個遠端位置不支援將項目丟到垃圾筒。

source: This string was found in Poedit’s translation memory.
en: Nigè striŋ wa fainden in Poedit dè transleiçion memori.

source: This suggestion was machine-translated online.
en: Nigè sùjjesçion wa transleiten-bai-kompyutā onlain.

source: This switch is deprecated; use -Wextra instead
en: 此開關已過時；請改用 -Wextra

source: This switch lacks documentation
en: 此開關缺少可用文件

source: This will remove all selected files and folders, and all files within any selected folders, from version control.
en: 這將從版本控制中移除所有選取的檔案及資料夾，及選取資料夾中的所有檔案。

source: Thumb: Generate (non-leaf) stack frames even if not needed
en: Thumb：即使不需要也產生(非葉)堆疊框架

source: Time to delay between each byte sent to the modem, in microseconds.
en: 發送到調製解調器的每個字節之間的延遲時間，以微秒為單位。

source: Time to wait for a connection, in seconds (without the option, default value is 30)
en: 連線的等待時間，以秒為單位（少了此選項，預設值將會是 30）

source: Timeout for the VPN service to establish the connection. Some services may take quite a long time to connect. Value of 0 means a default timeout, which is 60 seconds (unless overridden by vpn.timeout in configuration file). Values greater than zero mean timeout in seconds.
en: VPN服務建立連接的超時時間。某些服務可能需要很長時間才能連接。值0表示默認超時，即60秒（除非在配置文件中被vpn.timeout覆蓋）。大於零的值表示以秒為單位的超時。

source: Timeout in milliseconds used to check for the presence of duplicate IP addresses on the network. If an address conflict is detected, the activation will fail. A zero value means that no duplicate address detection is performed, -1 means the default value (either configuration ipvx.dad-timeout override or zero). A value greater than zero is a timeout in milliseconds. The property is currently implemented only for IPv4.
en: 用於檢查網絡上是否存在重複IP地址的超時（以毫秒為單位）。如果檢測到地址衝突，則激活將失敗。零值表示不執行重複地址檢測，-1表示默認值（配置ipvx.dad-timeout override或0）。大於零的值是以毫秒為單位的超時。該屬性目前僅適用於IPv4。

source: Too many arguments in call to '%s' at %L
en: 對「%s」的呼叫給出的參數太多，於 %L 處

source: Too many digits in statement label at %C
en: %C 處的敘述標籤太多位數

source: Total
en: Toutol

source: Traffic controls
en: 交通管制

source: Transformations
en: Transformeiçions

source: Translate WordPress theme or plugin
en: Transleit WordPress đöme or plùgin

source: Translated
en: Transleiten

source: Translated: %d of %d (%d %%)
en: Transleiten: %d of %d (%d %%)

source: Translation
en: Transleiçion

source: Translation Language
en: Transleiçion Leŋgueij

source: Translation Memory
en: Transleiçion Memori

source: Translation properties
en: Transleiçion propèrtis

source: Translation suggestions:
en: Transleiçion sùjjesçions:

source: Translation — %s
en: Transleiçion — %s

source: Translation:
en: Transleiçion:

source: Translations couldn’t be updated from the source code, because no code was found in the location specified in the catalog’s Properties.
en: Transleiçions couldn’t be updated from the source code, because no code was found in the location specified in the catalogue’s Properties.

source: Translations from this file are not shared with the online translation memory.
en: Transleiçions from nigè fayl dè kontribyuçion ga onlain transleiçion memori.

source: Translations with errors
en: Transleiçions wiŧ öras

source: Transport mode
en: 傳輸模式

source: Trap on integer divide by zero
en: 整數被零除時進入陷阱

source: Treat lines with 'D' in column one as comments
en: 將第一行為「D」的列視作註釋

source: Treat missing header files as generated files
en: 將缺失的標頭檔案看作產生的檔案

source: Treat the input file as already preprocessed
en: 將輸入檔案當作已經預先處理過的

source: Trim blank line differences from the start and end of changes
en: 從變更的開頭和結尾修剪空列的差異

source: Try 'jcf-dump --help' for more information.
en: 試用「jcf-dump --help」以獲取更多資訊。

source: Tun
en: 屯

source: Tune code for the given processor
en: 為指定的處理器最佳化程式碼

source: Tune expected memory latency
en: 調整預期記憶體延遲

source: Tunnel flags. Currently the following values are supported: NM_IP_TUNNEL_FLAG_IP6_IGN_ENCAP_LIMIT (0x1), NM_IP_TUNNEL_FLAG_IP6_USE_ORIG_TCLASS (0x2), NM_IP_TUNNEL_FLAG_IP6_USE_ORIG_FLOWLABEL (0x4), NM_IP_TUNNEL_FLAG_IP6_MIP6_DEV (0x8), NM_IP_TUNNEL_FLAG_IP6_RCV_DSCP_COPY (0x10), NM_IP_TUNNEL_FLAG_IP6_USE_ORIG_FWMARK (0x20). They are valid only for IPv6 tunnels.
en: 隧道標誌。目前支持以下值：NM_IP_TUNNEL_FLAG_IP6_IGN_ENCAP_LIMIT（為0x1），NM_IP_TUNNEL_FLAG_IP6_USE_ORIG_TCLASS（0X2），NM_IP_TUNNEL_FLAG_IP6_USE_ORIG_FLOWLABEL（為0x4），NM_IP_TUNNEL_FLAG_IP6_MIP6_DEV（0x8中），NM_IP_TUNNEL_FLAG_IP6_RCV_DSCP_COPY（0x10），以，NM_IP_TUNNEL_FLAG_IP6_USE_ORIG_FWMARK（0×20）。它們僅對IPv6隧道有效。

source: Two
en: 2-gè

source: Two main PROGRAMs at %L and %C
en: %L 和 %C 處有兩個主 PROGRAM

source: Type 'describe [<setting>.<prop>]' for detailed property description.
en: 輸入「describe [<setting>.<prop>]」以取得詳細的內容描述。

source: Type 'help' or '?' for available commands.
en: 輸入「help」或是「?」以取得可用指令。

source: Type 'print' to show all the connection properties.
en: 鍵入“print”以顯示所有連接屬性。

source: Type name '%s' at %C cannot be the same as an intrinsic type
en: 類型「%s」(位於 %C)不能與內建類型同名

source: Type name '%s' at %C is ambiguous
en: 類型名「%s」(於 %C 處)有歧義

source: URI is empty
en: URI為空

source: URI is not valid UTF-8
en: URI無效UTF-8

source: URI not NUL terminated
en: URI未終止NUL

source: UTF-8 (recommended)
en: UTF-8 (rekommenden)

source: UTF-8 encoded file path containing PAC for EAP-FAST.
en: 包含用於EAP-FAST的PAC的UTF-8編碼文件路徑。

source: UTF-8 encoded password used for EAP authentication methods. If both the "password" property and the "password-raw" property are specified, "password" is preferred.
en: 用於EAP身份驗證方法的UTF-8編碼密碼。如果同時指定了“password”屬性和“password-raw”屬性，則首選“password”。

source: UTF-8 encoded path to a directory containing PEM or DER formatted certificates to be added to the verification chain in addition to the certificate specified in the "ca-cert" property.
en: 除了“ca-cert”屬性中指定的證書之外，UTF-8編碼的路徑包含要添加到驗證鏈的PEM或DER格式證書的目錄。

source: UTF-8 encoded path to a directory containing PEM or DER formatted certificates to be added to the verification chain in addition to the certificate specified in the "phase2-ca-cert" property.
en: 除了“phase2-ca-cert”屬性中指定的證書之外，UTF-8編碼的路徑包含要添加到驗證鏈的PEM或DER格式證書的目錄。

source: Un_versioned
en: 未版本控制(_V)

source: Unable to add new connection: %s
en: 無法新增連線：%s

source: Unable to delete connection: %s
en: 無法刪除連線：%s

source: Unable to determine private key type.
en: 無法決定私密金鑰的類型。

source: Unable to save connection: %s
en: 無法儲存連線：%s

source: Unable to set hostname: %s
en: 無法設定主機名稱：「%s」

source: Unclassifiable statement in IF-clause at %C
en: %C 處 IF 子句中有無法歸類別的敘述

source: Undo
en: Ùndiodio

source: Undo the last action
en: 復原上一次的動作

source: Unexpected %s statement at %C
en: 非預期的 %s 敘述於 %C 處

source: Unexpected %s statement in BLOCK DATA at %C
en: 非預期的 %s 敘述出現在 %C 處的 DATA 區塊中

source: Unexpected %s statement in CONTAINS section at %C
en: 非預期的 %s 敘述出現在 %C 處的 CONTAINS 段中

source: Unexpected %s statement in FORALL block at %C
en: 非預期的 %s 敘述出現在 %C 處的 FORALL 區塊中

source: Unexpected %s statement in MODULE at %C
en: 非預期的 %s 敘述出現在 %C 處的 MODULE 中

source: Unexpected %s statement in WHERE block at %C
en: 非預期的 %s 敘述出現在 %C 處的 WHERE 區塊中

source: Unexpected EOF
en: 非預期的檔案結束

source: Unexpected amount of data after encrypting.
en: 加密後無預期的資料量。

source: Unexpected character in variable list at %C
en: %C 處變數清單中有非預期的無用字元

source: Unexpected characters in PARAMETER statement at %C
en: %C 處 PARAMETER 敘述中有非預期的字元

source: Unexpected end of file following '%s'
en: '意外的文件結尾'%s'

source: Unexpected end of module
en: 非預期的模組結束

source: Unexpected junk after ELSE statement at %C
en: %C 處 ELSE 敘述後有非預期的無用字元

source: Unexpected junk in formal argument list at %C
en: %C 處參數清單中有非預期的無用字元

source: Unexpected type in truthvalue_conversion
en: truthvalue_conversion 中類型非預期

source: Unexpected use of subroutine name '%s' at %C
en: 對子處理序名「%s」非預期的使用，在 %C 處

source: Unknown
en: 不明

source: Unknown activation error (%s)
en: Mǐ-wagari aktiveiçion öra (%s)

source: Unknown command argument: '%s'
en: 不明的檔案引數：「%s」

source: Unknown command: '%s'
en: 不明的指令：「%s」

source: Unknown error
en: 不明的錯誤

source: Unknown log domain '%s'
en: 不明日誌網域「%s」

source: Unknown log level '%s'
en: 不明日誌層級「%s」

source: Unknown parameter: %s
en: 不明的參數：%s

source: Unknown/unhandled Bluetooth connection type
en: 未知/未處理的藍牙連接類型

source: Unsupported key cipher for decryption
en: 用於解密的不受支持的密鑰密碼

source: Unsupported key cipher for encryption
en: 用於加密的不受支持的密鑰密碼

source: Unsupported statement inside WHERE at %L
en: %L 處在 WHERE 內不支援的敘述

source: Unterminated character constant beginning at %C
en: 開始於 %C 的未終結的字元常數

source: Unversioned
en: 未版本控制

source: Up
en: Ùp

source: Update all
en: Ùpdeit ol

source: Update all catalogs in the project
en: Ùpdeit ol katalogs in nigè prōjekt

source: Update catalog - synchronize it with sources
en: Ùpdeit katalog - synĥronais wiŧ sōrses

source: Update from POT
en: Ùpdeit from POT fayl

source: Update summary
en: Ùpdeit sùmmari

source: Update working copy from version control
en: 從版本控制更新工作副本

source: Updates
en: Ùpdeits

source: Updating catalog
en: Ùpdeitiŋ katalog

source: Updating failed
en: Ùpdeitiŋ feilen

source: Updating user information…
en: Ùpdeitiŋ yusa informeiçion…

source: Upgrade to Pro
en: Ùpgreid tu Pro

source: Uploading translations…
en: Ùploudiŋ transleiçions…

source: Usage
en: 用法

source: Usage: %s [OPTIONS]... CLASSNAMEmain [OUTFILE]
en: 用法：%s [選項]... main類別名 [輸出檔案]

source: Usage: %s [options] file...
en: 用法：%s [選項] 檔案...

source: Usage: jcf-dump [OPTION]... CLASS...
en: 用法：jcf-dump [選項]... 類別...

source: Usage: nmcli agent all { help } Runs nmcli as both NetworkManager secret and a polkit agent.
en: 用法：nmcli agent all {help}運行nmcli作為NetworkManager機密和polkit代理。

source: Usage: nmcli agent polkit { help } Registers nmcli as a polkit action for the user session. When a polkit daemon requires an authorization, nmcli asks the user and gives the response back to polkit.
en: 用法：nmcli agent polkit {help}將nmcli註冊為用戶會話的polkit操作。當polkit守護程序需要授權時，nmcli會詢問用戶並將響應返回給polkit。

source: Usage: nmcli agent secret { help } Runs nmcli as NetworkManager secret agent. When NetworkManager requires a password it asks registered agents for it. This command keeps nmcli running and if a password is required asks the user for it.
en: 用法：nmcli agent secret {help}運行nmcli作為NetworkManager秘密代理。當NetworkManager需要密碼時，它會向註冊代理詢問密碼。此命令使nmcli保持運行，如果需要密碼則詢問用戶。

source: Usage: nmcli agent { COMMAND | help } COMMAND := { secret | polkit | all }
en: 用法：nmcli agent {COMMAND |幫助}命令：= {secret | polkit |全部}

source: Usage: nmcli connection clone { ARGUMENTS | help } ARGUMENTS := [--temporary] [id | uuid | path] <ID> <new name> Clone an existing connection profile. The newly created connection will be the exact copy of the <ID>, except the uuid property (will be generated) and id (provided as <new name> argument).
en: 用法：nmcli連接克隆{ARGUMENTS |幫助} ARGUMENTS：= [--temporary] [id | uuid |路徑] <ID> <new name>克隆現有連接配置文件。新創建的連接將是該文件的精確副本 <ID>, ，除了uuid屬性（將生成）和id（提供為 <new name> 參數）。

source: Usage: nmcli connection import { ARGUMENTS | help } ARGUMENTS := [--temporary] type <type> file <file to import> Import an external/foreign configuration as a NetworkManager connection profile. The type of the input file is specified by type option. Only VPN configurations are supported at the moment. The configuration is imported by NetworkManager VPN plugins.
en: 用法：nmcli連接導入{ARGUMENTS |幫助} ARGUMENTS：= [--temporary]類型 <type> 文件 <file to import>將外部/外部配置導入為NetworkManager連接配置文件。輸入文件的類型由type選項指定。目前僅支持VPN配置。配置由NetworkManager VPN插件導入。

source: Usage: nmcli connection modify { ARGUMENTS | help } ARGUMENTS := [id | uuid | path] <ID> ([+|-]<setting>.<property> <value>)+ Modify one or more properties of the connection profile. The profile is identified by its name, UUID or D-Bus path. For multi-valued properties you can use optional '+' or '-' prefix to the property name. The '+' sign allows appending items instead of overwriting the whole value. The '-' sign allows removing selected items instead of the whole value. Examples: nmcli con mod home-wifi wifi.ssid rakosnicek nmcli con mod em1-1 ipv4.method manual ipv4.addr "192.168.1.2/24, 10.10.1.5/8" nmcli con mod em1-1 +ipv4.dns 8.8.4.4 nmcli con mod em1-1 -ipv4.dns 1 nmcli con mod em1-1 -ipv6.addr "abbe::cafe/56" nmcli con mod bond0 +bond.options mii=500 nmcli con mod bond0 -bond.options downdelay
en: 用法：nmcli連接修改{ARGUMENTS |幫助} ARGUMENTS：= [id | uuid |路徑] <ID> （[+ | - ]<setting>。<property> <value>）+修改連接配置文件的一個或多個屬性。配置文件由其名稱，UUID或D-Bus路徑標識。對於多值屬性，您可以對屬性名稱使用可選的“+”或“ - ”前綴。 “+”符號允許附加項而不是覆蓋整個值。 “ - ”符號允許刪除所選項而不是整個值。示例：nmcli con mod home-wifi wifi.ssid rakosnicek nmcli con mod em1-1 ipv4.method manual ipv4.addr“192.168.1.2 / 24,10.10.1.5/8”nmcli con mod em1-1 + ipv4.dns 8.8。 4.4 nmcli con mod em1-1 -ipv4.dns 1 nmcli con mod em1-1 -ipv6.addr“abbe :: cafe / 56”nmcli con mod bond0 + bond.options mii = 500 nmcli con mod bond0 -bond.options downdelay

source: Usage: nmcli connection show { ARGUMENTS | help } ARGUMENTS := [--active] [--order <order spec>] List in-memory and on-disk connection profiles, some of which may also be active if a device is using that connection profile. Without a parameter, all profiles are listed. When --active option is specified, only the active profiles are shown. --order allows custom connection ordering (see manual page). ARGUMENTS := [--active] [id | uuid | path | apath] <ID> ... Show details for specified connections. By default, both static configuration and active connection data are displayed. It is possible to filter the output using global '--fields' option. Refer to the manual page for more information. When --active option is specified, only the active profiles are taken into account. Use global --show-secrets option to reveal associated secrets as well.
en: 用法：nmcli連接顯示{ARGUMENTS |幫助} ARGUMENTS：= [--active] [ - order <order spec>列出內存和磁盤上的連接配置文件，如果設備使用該連接配置文件，其中一些配置文件也可能處於活動狀態。如果沒有參數，則列出所有配置文件。指定--active選項時，僅顯示活動的配置文件。 --order允許自定義連接排序（參見手冊頁）。 ARGUMENTS：= [ - active] [id | uuid |路徑|一條路徑] <ID> ...顯示指定連接的詳細信息。默認情況下，將顯示靜態配置和活動連接數據。可以使用全局'--fields'選項過濾輸出。有關更多信息，請參閱手冊頁。如果指定了--active選項，則僅考慮活動配置文件。使用全局--show-secrets選項來顯示相關的秘密。

source: Usage: nmcli device modify { ARGUMENTS | --help } ARGUMENTS := <ifname> ([+|-]<setting>.<property> <value>)+ Modify one or more properties currently active on the device without modifying the connection profile. The changes have immediate effect. For multi-valued properties you can use optional '+' or '-' prefix to the property name. The '+' sign allows appending items instead of overwriting the whole value. The '-' sign allows removing selected items instead of the whole value. Examples: nmcli dev mod em1 ipv4.method manual ipv4.addr "192.168.1.2/24, 10.10.1.5/8" nmcli dev mod em1 +ipv4.dns 8.8.4.4 nmcli dev mod em1 -ipv4.dns 1 nmcli dev mod em1 -ipv6.addr "abbe::cafe/56"
en: 用法：nmcli設備修改{ARGUMENTS | --help} ARGUMENTS：= <ifname> （[+ | - ]<setting>。<property> <value>）+修改設備上當前活動的一個或多個屬性，而不修改連接配置文件。這些變化立即生效。對於多值屬性，您可以對屬性名稱使用可選的“+”或“ - ”前綴。 “+”符號允許附加項而不是覆蓋整個值。 “ - ”符號允許刪除所選項而不是整個值。示例：nmcli dev mod em1 ipv4.method manual ipv4.addr“192.168.1.2 / 24,10.10.1.5/8”nmcli dev mod em1 + ipv4.dns 8.8.4.4 nmcli dev mod em1 -ipv4.dns 1 nmcli dev mod em1 -ipv6.addr“abbe :: cafe / 56”

source: Usage: nmcli monitor Monitor NetworkManager changes. Prints a line whenever a change occurs in NetworkManager
en: 用法：nmcli監視器監視NetworkManager的更改。每當NetworkManager發生更改時打印一行

source: Use "nmcli device show" to get complete information about known devices and "nmcli connection show" to get an overview on active connection profiles. Consult nmcli(1) and nmcli-examples(7) manual pages for complete usage details.
en: 使用“nmcli device show”獲取有關已知設備的完整信息和“nmcli connection show”以獲取有關活動連接配置文件的概述。有關完整的使用詳細信息，請參閱nmcli（1）和nmcli-examples（5）手冊頁。

source: Use %s→%s for full WordPress functionality.
en: Yus %s→%s für full WordPress functionality.

source: Use 128-bit long double
en: 使用 128 位 long double

source: Use 16 bit int
en: 使用 16 位整數

source: Use 32 bit float
en: 使用 32 位元浮點數

source: Use 32 bit int
en: 使用 32 位元整數

source: Use 32-bit ABI
en: 使用 32 位元 ABI

source: Use 32-bit floating-point registers
en: 使用 32 位元浮點暫存器

source: Use 32-bit general registers
en: 使用 32 位元通用暫存器

source: Use 4 byte entries in switch tables
en: 在分支表中使用 4 位元組長的條目

source: Use 4 media accumulators
en: 使用 4 個多媒體累加器

source: Use 64 FPRs
en: 使用 64 個浮點暫存器

source: Use 64 GPRs
en: 使用 64 個通用暫存器

source: Use 64 bit float
en: 使用 64 位元浮點數

source: Use 64-bit ABI
en: 使用 64 位元 ABI

source: Use 64-bit floating-point registers
en: 使用 64 位元浮點暫存器

source: Use 64-bit general registers
en: 使用 64 位元通用暫存器

source: Use 64-bit long double
en: 使用 64 位元 long double

source: Use 8 media accumulators
en: 使用 8 個多媒體累加器

source: Use ABI reserved registers
en: 使用 ABI 保留的暫存器

source: Use EABI
en: 使用 EABI

source: Use GP relative sdata/sbss sections
en: 使用相對 GP 的 sdata/sbss 區段

source: Use H8/300 alignment rules
en: 使用 H8/300 對齊規則

source: Use IEEE math for fp comparisons
en: 浮點數間的比較嚴格遵循 IEEE 標準

source: Use Mingw-specific thread support
en: 使用 Mingw 特定的執行緒支援

source: Use NewABI-style %reloc() assembly operators
en: 使用 NewABI 風格的 %reloc() 組譯運算子

source: Use P-mnemonics for branches statically predicted as taken
en: 為靜態預測為必要進行的跳轉使用 P 助憶符號

source: Use POWER instruction set
en: 使用 POWER 指令集

source: Use POWER2 instruction set
en: 使用 POWER2 指令集

source: Use PowerPC General Purpose group optional instructions
en: 使用 PowerPC 通用組可選指令

source: Use PowerPC Graphics group optional instructions
en: 使用 PowerPC 圖像組可選指令

source: Use PowerPC V2.01 single field mfcr instruction
en: 使用 PowerPC V2.01 單欄位 mfcr 指令

source: Use PowerPC V2.02 popcntb instruction
en: 使用 PowerPC V2.02 popcntb 指令

source: Use PowerPC instruction set
en: 使用 PowerPC 指令集

source: Use PowerPC-64 instruction set
en: 使用 PowerPC-64 指令集

source: Use ROM instead of RAM
en: 使用 ROM 而不是 RAM

source: Use SSE register passing conventions for SF and DF mode
en: 在 SF 和 DF 模式下使用 SSE 暫存器呼叫約定

source: Use TCP header compression
en: 使用TCP標頭壓縮

source: Use UNIX assembler syntax
en: 使用 UNIX 組譯風格

source: Use VAX fp
en: 使用 VAX 浮點單元

source: Use __cxa_atexit to register destructors
en: 將 __cxa_atexit 而非 atexit 登記為解構函式

source: Use _default system editor
en: 使用預設系統編輯器(_D)

source: Use a 32-bit long type
en: 使用 32 位元 long 類型

source: Use a 64-bit long type
en: 使用 64 位元 long 類型

source: Use addresses that allocate global registers
en: 使用指派全域暫存器的位址

source: Use alternate register names
en: 使用另一套暫存器名

source: Use an 8-bit 'int' type
en: 使用 8 位「int」類型

source: Use an IPv6 temporary privacy address
en: 使用IPv6臨時隱私地址

source: Use arbitrary sized immediates in bit operations
en: 在位作業中使用任意大小的立即數值

source: Use big-endian byte order
en: 令高位位元組在前

source: Use big-endian format for unformatted files
en: 使用低位位元組格式於未格式的檔案

source: Use branch-and-break sequences to check for integer divide by zero
en: 使用分支-插斷序列來偵測整數零除

source: Use call-clobbered registers for parameters and return value
en: 將呼叫篡改的暫存器用於參數和回傳值

source: Use custom expression
en: Yus kùstomaisen ikspresçion

source: Use custom list font:
en: Yus kùstomaisen taipfeis in list:

source: Use custom text fields font:
en: Yus kùstomaisen taipfeis in tekst fīlds :

source: Use default rules for this language
en: Yus difàult rūls für nigè leŋgueij

source: Use differences between:
en: 使用兩者之不同：

source: Use different calling convention using 'rtd'
en: 啟用使用「rtd」的不同的呼叫約定

source: Use direct references against %gs when accessing tls data
en: 當存取執行緒局部資料時直接參照 %gs

source: Use epsilon-respecting floating point compare instructions
en: 使用在意無窮小的浮點比較指令

source: Use expression value profiles in optimizations
en: 在最佳化中使用運算式值樣本提供的資訊

source: Use f2c calling convention
en: 使用 f2c 呼叫約定

source: Use features of and schedule code for given CPU
en: 使用指定 CPU 的特性和調度程式碼

source: Use features of and schedule given CPU
en: 使用指定 CPU 的特性並為其調度程式碼

source: Use fp double instructions
en: 使用浮點雙精度指令

source: Use fp registers
en: 使用浮點暫存器

source: Use given SPARC-V9 code model
en: 使用給定的 SPARC-V9 程式碼模型

source: Use given assembler dialect
en: 使用給定的組譯風格

source: Use given thread-local storage dialect
en: 使用給定的執行緒局部存儲模式

source: Use given x86-64 code model
en: 使用給定的 x86-64 程式碼模式

source: Use hardware FP
en: 使用硬體浮點單元

source: Use hardware floating point
en: 使用硬體浮點單元

source: Use hardware fp
en: 使用硬體浮點單元

source: Use hardware quad FP instructions
en: 使用硬體四浮點指令

source: Use in/loc/out register names
en: 使用 in/loc/out 暫存器名

source: Use indirect calls
en: 使用間接呼叫

source: Use jump tables for sufficiently large switch statements
en: 為足夠大的 switch 敘述使用跳轉表

source: Use little-endian byte order
en: 令低位位元組在前

source: Use little-endian format for unformatted files
en: 使用低位位元組格式於未格式的檔案

source: Use media instructions
en: 使用多媒體指令
